<a href="https://colab.research.google.com/github/avs20/SioLabsPython0/blob/main/15_Pandas_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Almost Everything with pandas 
-----------

CSV - > Comma Separated Value 
TSV - > Tab Separated Value

In [1]:
import pandas as pd

In [2]:
# read a csv file 

data = pd.read_csv('/content/train.csv')

In [3]:
data

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [4]:
# what is the shape of data 
data.shape

(891, 12)

In [5]:
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [6]:
data.tail()

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

In [8]:
data[50:55]

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
50           51         0       3  ...  39.6875   NaN         S
51           52         0       3  ...   7.8000   NaN         S
52           53         1       1  ...  76.7292   D33         C
53           54         1       2  ...  26.0000   NaN         S
54           55         0       1  ...  61.9792   B30         C

[5 rows x 12 columns]

In [9]:
# what are columns 
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
data['Sex'] == 'male'

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: Sex, Length: 891, dtype: bool

In [11]:
data[ data['Sex'] == 'male' ]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
4              5         0       3  ...   8.0500   NaN         S
5              6         0       3  ...   8.4583   NaN         Q
6              7         0       1  ...  51.8625   E46         S
7              8         0       3  ...  21.0750   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
883          884         0       2  ...  10.5000   NaN         S
884          885         0       3  ...   7.0500   NaN         S
886          887         0       2  ...  13.0000   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[577 rows x 12 columns]

In [12]:
data.loc[ data['Sex'] == 'male' , : ]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
4              5         0       3  ...   8.0500   NaN         S
5              6         0       3  ...   8.4583   NaN         Q
6              7         0       1  ...  51.8625   E46         S
7              8         0       3  ...  21.0750   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
883          884         0       2  ...  10.5000   NaN         S
884          885         0       3  ...   7.0500   NaN         S
886          887         0       2  ...  13.0000   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[577 rows x 12 columns]

In [14]:
data.loc[ data['Sex'] == 'male' , ['Survived'] ]

     Survived
0           0
4           0
5           0
6           0
7           0
..        ...
883         0
884         0
886         0
889         1
890         0

[577 rows x 1 columns]

In [17]:
data.loc[ (data['Sex'] == 'male') & (data['Age'] < 20) , ['Survived'] ]

     Survived
7           0
16          0
27          0
50          0
59          0
..        ...
841         0
844         0
850         0
869         1
877         0

[89 rows x 1 columns]

In [18]:
final_data = data.loc[ (data['Sex'] == 'male') & (data['Age'] < 20) , ['Survived'] ]
final_data.to_csv('titatnic_cleaned.csv')

In [21]:
df = pd.read_csv('titatnic_cleaned.csv')

In [22]:
df.head()

   Unnamed: 0  Survived
0           7         0
1          16         0
2          27         0
3          50         0
4          59         0

In [24]:
final_data.to_csv('titatnic_cleaned.csv', index=False)
df = pd.read_csv('titatnic_cleaned.csv')
df.head()

   Survived
0         0
1         0
2         0
3         0
4         0

In [25]:
data = pd.read_csv('train.csv')
data.head(2)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C

[2 rows x 12 columns]

In [26]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [27]:
data.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [28]:
# value_counts() -> counts each value 
data['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [29]:
data['Survived'].sum()

342

In [30]:
data['Survived'].count()

891

In [32]:
data['Survived'][ data['Survived'] == 0].count()

549

In [38]:
data['Survived'] [data['Survived'] == 0 ].sum()

0

In [34]:
data['Survived'] == 0

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Name: Survived, Length: 891, dtype: bool

In [41]:
out = [ data['Survived'] == 0 ]
type(out)

list

In [42]:
out.count()

TypeError: ignored

In [43]:
tlist = [1,2,3,1,2,3,1,1,1,1]
tlist.count(1)

6

In [46]:
# groupby 
data.groupby('Sex')['Survived'].value_counts()

Sex     Survived
female  1           233
        0            81
male    0           468
        1           109
Name: Survived, dtype: int64